# Full personal/dev profile. Keep company/private packages out of this file.
tap "ankitpokhrel/jira-cli"
tap "cirruslabs/cli"
tap "codecrafters-io/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "jesseduffield/lazydocker"
tap "johanhaleby/kubetail"
tap "k8sgpt-ai/k8sgpt"
tap "kubeshark/kubeshark"
tap "localstack/tap"
tap "nikitabobko/tap"
tap "sst/tap"

# Minimal baseline
brew "atuin"
brew "bat"
brew "curl"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "htop"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "powerlevel10k"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CLI utilities
brew "aom"
brew "aria2"
brew "asciinema"
brew "bench"
brew "bpytop"
brew "cmake"
brew "exa"
brew "gcalcli"
brew "gitlint"
brew "gnutls"
brew "gping"
brew "grep"
brew "grip", link: false
brew "httpstat"
brew "ijq"
brew "jid"
brew "jnv"
brew "jpeg-xl"
brew "neofetch"
brew "nmap"
brew "parallel"
brew "poppler"
brew "rm-improved"
brew "socat"
brew "telnet"

# Containers, cloud, and Kubernetes
brew "awscli"
brew "colima"
brew "docker"
brew "helm"
brew "kubernetes-cli"
brew "kubectx"
brew "stern"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform", link: false
brew "hashicorp/tap/terraform-ls"
brew "hidetatz/tap/kubecolor"
brew "jesseduffield/lazydocker/lazydocker"
brew "johanhaleby/kubetail/kubetail"
brew "k8sgpt-ai/k8sgpt/k8sgpt"
brew "kubeshark/kubeshark/kubeshark"
brew "localstack/tap/localstack-cli"

# Language runtimes and developer tooling
brew "black"
brew "cffi"
brew "cryptography"
brew "ffmpeg"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "graphviz"
brew "harfbuzz"
brew "libass"
brew "librsvg"
brew "libpq"
brew "librist"
brew "lua"
brew "luarocks"
brew "node"
brew "openjdk@8"
brew "openjdk@11"
brew "openvino"
brew "pango"
brew "prettier"
brew "protobuf"
brew "protobuf@3"
brew "pycparser"
brew "redis"
brew "ruby-build"
brew "rubyfmt"
brew "ruff"
brew "ruff-lsp"
brew "semgrep"
brew "shfmt"
brew "stylua"
brew "unbound"

# Personal apps and window/status bar tools
brew "cirruslabs/cli/tart"
brew "codecrafters-io/tap/codecrafters"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "rtk"
brew "scrcpy"
brew "sst/tap/opencode"

# GUI apps and fonts
cask "nikitabobko/tap/aerospace"
cask "another-redis-desktop-manager"
cask "cursor"
cask "cursor-cli"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iina"
cask "mockoon"
cask "numi"
cask "postman"

# Selected global tools
go "github.com/bufbuild/buf/cmd/buf"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golang/mock/mockgen"
npm "@google/gemini-cli"
npm "typescript"
npm "yarn"
