# Full personal/dev profile. Keep company/private packages out of this file.

# Minimal baseline
brew "atuin"
brew "bat"
brew "curl"
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "htop"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "powerlevel10k"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CLI utilities
brew "aria2"
brew "bench"
brew "bpytop"
brew "cmake"
brew "gitlint"
brew "gnutls"
brew "gping"
brew "grep"
brew "grip", link: false
brew "ijq"
brew "telnet"

# Containers, cloud, and Kubernetes
brew "colima"
brew "docker"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "stern"

# Language runtimes and developer tooling
brew "black"
brew "cffi"
brew "cryptography"
brew "ffmpeg"
brew "go"
brew "golangci-lint"
brew "gopls"
brew "graphviz"
brew "isort"
brew "libass"
brew "librsvg"
brew "libpq"
brew "librist"
brew "lua"
brew "luarocks"
brew "node"
brew "openjdk@11"
brew "prettier"
brew "protobuf"
brew "pycparser"
brew "redis"
brew "rust"
brew "ruff"
brew "ruff-lsp"
brew "semgrep"
brew "shfmt"
brew "stylua"
brew "unbound"

# Personal apps
brew "rtk"

# GUI apps and fonts
cask "another-redis-desktop-manager"
cask "cursor"
cask "cursor-cli"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iina"
cask "mockoon"
cask "numi"
cask "postman"

# Selected global tools
go "github.com/bufbuild/buf/cmd/buf"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/golang/mock/mockgen"
npm "@google/gemini-cli"
npm "typescript"
npm "yarn"
